import { Composition, staticFile } from "remotion";
import { Audiogram } from "./Audiogram/Main";
import { audiogramSchema } from "./Audiogram/schema";
import { FPS } from "./helpers/ms-to-frame";
import { parseMedia } from "@remotion/media-parser";
import { getAudioPathAndCaptions } from "./helpers/word-to-audio";

const calculateMetadata = async ({ props }) => {
    // 获取问题的音频和字幕
    const { audioFilePath: audioQuestionFileUrl, captions: questionCaptions } =
        await getAudioPathAndCaptions(props.questionText);

    const { audioFilePath: audioAnswerFileUrl, captions: answerCaptions } =
        await getAudioPathAndCaptions(props.answerText);

    // 获取问题音频的长度
    const { slowDurationInSeconds: questionInSeconds } = await parseMedia({
        src: audioQuestionFileUrl,
        acknowledgeRemotionLicense: true,
        fields: {
            slowDurationInSeconds: true,
        },
    });

    // 获取回答音频的长度
    const { slowDurationInSeconds: answerInSeconds } = await parseMedia({
        src: audioAnswerFileUrl,
        acknowledgeRemotionLicense: true,
        fields: {
            slowDurationInSeconds: true,
        },
    });

    const { slowDurationInSeconds: thanksInSeconds } = await parseMedia({
        src: staticFile("thanks.mp3"),
        acknowledgeRemotionLicense: true,
        fields: {
            slowDurationInSeconds: true,
        },
    });

    // 返回视频的长度和一些参数
    return {
        durationInFrames: Math.ceil(
            (answerInSeconds + questionInSeconds + thanksInSeconds) * FPS,
        ),

        props: {
            ...props,
            answerCaptions,
            questionInSeconds,
            answerInSeconds,
            thanksInSeconds,
            audioQuestionFileUrl,
            audioAnswerFileUrl,
            defaultOutName: props.questionText,
        },
        fps: FPS,
    };
};

export const RemotionRoot: React.FC = () => {
    return (
        <Composition
            id="Audiogram"
            component={Audiogram}
            width={1920}
            height={1080}
            schema={audiogramSchema}
            defaultProps={{
                questionText: "请大神指点，对斯宾格勒的历史观的看法是什么？",
                answerText:
                    "文明没落之说并非没有前声，尼采早在斯宾格勒之前半个世纪就预感到这一切，你如果只将尼采当作一个疯癫的诗人来认知，简单地将超人图解为时下三流小说中的庸俗小资产阶级形象，就会看不见诗化哲学背后，他作为冷酷哲人的那一面：洞察人心，明晰万物，早在西方文明如日中天之际，就意识到哲人/超人迟早将被大众放逐，庸众在广场群蝇的孳生里自甘为末人，乞求科层制官僚国家施舍的微末嗟来之食，在无尽的永劫轮回中化作历史的劫灰，等待时间的终结。曾经肆虐在亚细亚的时间之外的往事，今日也轮到美丽的欧罗巴。　　 时间的终结在基督教语境里有其特殊意义，这意味着耶稣基督再一次并且是最后一次来到人间，为人类做出公正的审判，良善的人统统复活，随天使被接引至神圣天堂，邪恶的人则自有其报应，在地狱还是在炼狱则看罪孽的程度。时间终结了，历史不再有其意义，因为善与恶已然两明，好坏各得其所，时间如果再流动不过取其物理上的意义，在神性的谱系里它已经了结一切。 　　 十九世纪以来的历史终结论，则反其道而行，他们像柏拉图一样认为历史不断在下行，一直腐败堕落到无可堕落，历史终结了，是因为历史的意义仿佛月亮女神阿尔忒弥斯手中的蜡烛，燃烧殆尽，善与恶被一同抹消，仿佛泰晤士河畔的桨声灯影，影影绰绰，干净地早已不见一丝血色。当然，这里的腐败指代的是古希腊与古罗马语境中，政客罔顾公共和长远的利益，以自私和短期的恩惠收买选票；跟中国传统意义上的腐败相比，行贿者和受贿者恰好交换了位置。 　　 这个道德的谱系可以从尼采追索到托克维尔、贡斯当、柏克、休谟，乃至光荣革命诸君子，其实是中世纪史诗社会在近代散文社会中的一个少有人注意的尾音。艾略特与切斯特顿是这个道德谱系的历史中间物，如果用历史观相学进行牵强类比的话，那么托克维尔、贡斯当与孟子同享一个时代，而艾略特、斯宾格勒则是伏生一类人物，前者观察到贵族的没落，并意识到社会即将扁平化与原子化，后者亲身经历社会的解体，努力参与到共同体的重建中却以失败告终，一战对欧洲文明的动摇无异于秦汉之变，我们将看到末人抬头，如蛆虫蛀蚀着脚下的文明，最后与文明同归于尽。 　　 十九世纪末叶一切非理性主义学说的兴起，都是在力图摆脱末人与历史终结的阴暗图景。但在一战之前，整个欧洲流行着一种浅薄欢快的氛围，诚然，此时整个世界都是欧洲的殖民地，也从来没有哪个文明达到如此高度，将现代性卵翼众生，欧洲人有理由在上帝死后，为人类的理性与辉煌的成就而自傲，就像刚高考完的年轻人，以为日后前程也将一帆风顺，并将这份过于奢侈的乐观带入新的战争中来。人们像欢迎圣诞节一样欢迎战争的到来，为平凡无聊的闲暇时光增添乐趣。 　　 德意志霍亨索伦王室的宣传和控制技术远不如日后的希特勒，但在民众中激发的狂热纳粹帝国却永远不能望其项背；法兰西以应付1871年普法战争绅士决斗的方式迎接1914年鲁登道夫总体战，一如日后他将以1914年的堑壕战应对1939年的闪电战；在佛兰德斯平原上埋葬着伊顿公学诺曼贵族的血脉，妖冶的罂粟花在寒风中摇荡；哈耶克晚年感慨自己在学术上能出头，不过是因为维也纳同时代的英杰在战场上都死光了。 　　 理性与启蒙之光黯然褪色，一代人的脊梁骨被彻底粉碎，文明与理性带来的荣耀被总体战反复凌辱。不幸的是，这并非灾厄的结束，二十年后他们将再度重复这一梦魇，哪怕大半个世纪过去回忆往事也会隐隐作痛。 　　 于是，冷眼旁观一切的斯宾格勒抱持如下信念写下他的著作：每一个文明都必将经历生老病死轮回，而他作为相术师，截取历史的只言片语，直观每一代人的精神与气质，高贵亦或卑贱，慷慨亦或猥琐，以已然消亡的文明的命运为鉴，判断而今的文明已走到何种地步。他所擅长的乃是一种情境模拟能力，通过观察命运的进程，梳理重要节点，判断大势所趋。实证考据实非此书专长，因此被这本旁征博引的巨著折磨地焦头烂额的勤劳读者切勿将每一个细节都当真，知其大旨即可。就像我们皆知人都有一死，以何种方式夭亡却超出我们预测能力。 　　 这仿佛相面术，通过察看一个人脸部的某些特征，来判断对方此时的命运吉凶及身体状况。江湖术士根据经验总结出规律，知道我们的身体姿态面部表情精神气劲很难遮掩近来幸与不幸的际遇，倘若你对预言精准感到惊诧不已，说明你还是更适合像哲不解一样，呆在象牙塔里读女博士。我们不能否认这必然伴随根深蒂固的偏见，一如占卜师不会每次都预测正确，然而偏见符合人类理性认识世界的贝叶斯信息更新过程，在足够多的样本面前，偏见足以完美地解释世界，恰如切特斯顿所言：偏见是智慧之母，伟大的偏见蕴涵着比事实更深刻的智慧。 　　 这种相术的直觉，被斯宾格勒称之为观相的历史方法，我们也可以称之为历史观相学。我在文章之初就提到，预感文明没落与腐败并非斯宾格勒的专利，判断命运趋势的情景模拟能力在人类历史上他亦难说最佳，据我所知，早在古罗马时代乃至华夏春秋战国就有能与其伯仲者，如果我们不说犹有胜之的话。他所新颖的地方，反倒在于修辞。在他之前，从来没有人想过，通过比较形态学的方式，对不同文化形态进行观相的比较，来揭示历史无可奈何的必然性。大仲马说，大狗叫，小狗也叫，毕竟有所不同。 　　 如果有人阅读《西方的没落》可曾有过愉悦，抛却被他像耶利米先知颁布耶和华神谕一样勾勒历史必然性的堂皇威严所震慑，多半是由于斯宾格勒诗一般的语言，不时点缀于经典的德式饶舌之中，让我辈智商捉急者产生以愚夫之力，可详尽理解此书的幻觉。 　　 在伽达默尔解释学看来，含糊其辞的语言从来无助于概念的清晰，反倒会将我们拐进存在的歧途之中，但要用工笔描绘斯宾格勒思想每一个角落本来就不是我们（能够负担）的重任，一如预言历史的每一个细节，也是超出他能力的妄想。使用诗性的语言来写作，违背了无产阶级专业学术界任何一条可以被违背的规范，却与命运的不详不实凑巧对应，从这个角度来讲，偷懒只描摹斯宾格勒思想的基本脉络，在角落处吞吞吐吐一笔带过也不能说有错。如果你发现本文存在对他无伤大雅的误解，无需惊讶，作者乐意于此，读者不必在意，这种无聊的隐喻也是斯宾格勒在他的修辞术里热衷采用的小彩蛋。 　　 由于深受德国唯心主义与唯意志论的影响，斯宾格勒相信存在超越原子个人简单相加的实体，在他笔下便是所谓文明、文化与民族，或者说，他认为文化上千年绵延不绝，个人的生老病死在这长时空中一同组成了我们今日所见的不同文化实体。这些实体至今为止共有八个，与万物万生一般都将经历生老病死，春夏秋冬四阶段轮回的过程，这里所谓的生老病死指的并非仅是字面上的意思，而是价值谱系上的兴衰，汤因比用自决能力的有无与起降来指代似乎矮化了这一概念。 　　 在进一步阐释所谓西方的没落时，斯宾格勒列举了三种理想型：原始民族、文化民族与费拉民族，窃以为刘仲敬所举的史前之人、历史中人、史后之人比汤因比更有助于我们理解。史前之人如韩原野人，只知饱食终日无所用心，茫然于天地，不知圣人文章为何物；历史中人如孔子，为礼崩乐坏惶惶如丧家之犬；史后之人如范进，为科举及第功名利禄四方奔竞，却无意向于礼乐教化。 　　 所谓文化的生死，西方的没落，指的就是人们就文化的法统与宪法解释权进行斗争的过程，一旦无人在意文化的法统与道统，失去对文化的所有自信，没有延续文化的意愿，活着只是为了生物意义上的活着，而不是历史意义上的活着，哪怕披挂着文化的外壳苟延残喘，在隐喻的层面它其实已经死了。换句话说，哪怕某种文化早日烟消云散，只要人们还有继承他的意愿，其实理论上也可以起死还生，虽然这不大可能。 　　 对文化实体生与死的隐喻，它绝非永生不死之物，是斯宾格勒文化形态学的核心，是最重要的灵知，至于递次经历春夏秋冬四个阶段的譬喻，反倒不过是他使用观相的历史方法，在援引比较大量细节上需要商榷的史料后，给出的直观印象，在重要性反倒居于其次，虽然也很有洞察力。我们不必否认，斯宾格勒在编排几千年历史，进入这个框架时肯定会有削足适履的现象，然而这无损于这个框架的美感与解释力。 　　 与传统的刻板印象不同，斯宾格勒并非一个后现代意义上的多元主义者，亦如你不能将施特劳斯解释为一个庸俗的相对主义者。东方文化的读者在阅读此书时，切莫将斯宾格勒视为已经走出欧洲中心论的中国人民的老朋友，他在书中对非西方文化的称颂，不过是出于一名绅士的礼貌而做出的恭维。只要我们想起，在斯宾格勒的框架里，只有西方文化虽然即将没落，却依然富有活力，其他七种文化已然僵死时，再回过头看他对非西方文化的恭维，就能解读出无尽的言外之意。 　　 在他的视野里，文化的身影只可能从自我意识觉醒的文化民族之中勃然而兴，抖落无知无觉的混沌，在自我与他者的间隔和区分里认识你自己，从而开始他漫长的一生。原始民族乌有文化的自觉，仅是植物性的存在，他们与无形态没有边界的大宇宙俱同一体，无智无识，是卢梭笔下高贵的野蛮人，对世界怀持朴素的敬畏，行走于丛林之中，“不知有汉，何论魏晋。”必须在存在的醒觉意识澄明解蔽以后，方形成具体有限的文化形态，先民被组织起来，形成一个天地人神四体同居的共同体。 　　 斯宾格勒认为，各文化形态都经历过或正在经历春夏秋冬四个阶段，文化初生之时为春季，斯宾格勒称之为文化的早期阶段，此时为阶级社会，由军人贵族与祭祀僧侣主导，阶级森严，尊卑判然，但没有一个凌驾于各阶级之上、外在于社会的强大政权，各阶级由法统与传统赋予的诸特权与诸自由自我治理，彼此不得逾越。国家机器方见雏形，尚未有日后压垮所有阶级，以所有组织资源为自己血食的威能。人们扎根于土地，在乡村之中呼吸古老的自由，这里的自由是英国意义上的，不受他人强制的自由。 　　 他们虔敬神明，以尚武为美德，以担当为天职，不事奢侈。共同体内部的联系是有机的，自组织资源丰裕，并非被外在强力纽合在一起一团散沙的乌合之众。他们的理性尚未发达到解构一切，却偏偏不解构自己虚荣心的地步，对亘古星辰怀有本能的敬畏，因而尊崇神明的戒律与道德的准则，奉之而不易，旺盛的生育力本能的繁衍后代，血气十足。 　　 一般来说，文化的春季极为漫长，在绝大多数人看来，这是一个了无新意的黑暗时代，然而它却是为日后的刹那光华积累力量。最初的历史中人不以私智贪天之功，风气淳朴，没有虚荣心，以默默耕耘为务。等到人们厌倦耕耘，阶级开始缓缓解体，游士出现，奔竞之风稍行于世，此时文化实体便进入夏天，零星的城镇出现，散落于大地，像孤岛被海洋包围，市民乃至商人阶级集体登场，工具理性发展，人们开始有意识地批判过往的信念，就仿佛叛逆的青年对父亲的反抗，国家机器开始伸展它越来越长的触角。 　　 随着工具理性与经济理性发展到烂熟，文化进入秋季，理论上这是一个收获的季节，但在斯宾格勒看来，这却是一个挥霍的季节，他称之为文化的晚期阶段，人们将祖先的积累在此际挥霍一空，因而文化的秋天非常短暂，又因其空前辉煌，使人念念不忘，比如雅典的伯里克利时代，华夏的战国，以及短暂的十九世纪，经年累月的黑暗，换来片刻阳光下的蹀躞。阶级解体速度骤然变快，自组织资源迅速被消耗，人们涌进城市中，积攒在内层的能量被一下子点燃，出现不真实的黄金时代，在艺术与科学上达到的高度让后人难以企及，只能遥遥追望。 　　 与此同时，伴随的却是社会的扁平化，贵族精神没落，平民化大行于道，尚武的美德被柔顺的和平主义打压，人们将战事委之于雇佣士兵，浇浞之风取代了朴实刚健的民德，崇尚权变奸诈的厚黑学逐渐更替对神明与道德的信仰。由于自组织资源的消耗，国家机器成为唯一能够仰仗的组织体系，不断壮大，或者说，两者互为因果。 　　 当祖先的积累被彻底挥霍一空时，凛冬便至，斯宾格勒称之时的文化变成了文明，彻底地僵死，不复有生机与活力，只是因为历史的惯性而苟延残喘。国家机器彻底坐大，以生民为血食，如迦太基神话里的摩洛克邪神，人们却再也离不开它，他们需要官僚机器来统治自己，一如需要面包与空气，汤因比所谓自决能力丧失殆尽，只能仍由颟邗无能的官僚来统治。决断、担当、勇敢诸美德已成上个纪元的遗迹，由于共同体内部维系彼此的组织纽带断裂，人与人互不信任，置身其中仿佛身居霍布斯丛林之中。他们也只相信丛林主义的教条，对陌生人的友善抱以最大的怀疑，外人临此，怀疑自己身入鬼国。 　　 出现世界性的大都市，汲取所有资源奉其一身，不同地域的区分已经不再重要，因为此时只有首都市民与外省人的对立，农村被世界性都市吞没，人们像沙丁鱼般拥挤于世界大都市之中，以福利国家的面包和马戏为务。机会主义盛行，人们重视短期功利，以当下一时幸福为乐，再也没有人注重积累，而文化的本质却是人们以辛勤的劳作，驱赶大地之上的悲怆与虚无。 　　 解构一切的理性发达成熟，最终除了自身的虚荣心以外，解构了一切。法统与宪法习惯再也不重要，没有人珍视国本斗争的意义。对于他们来说，承担历史意义是痛苦的，一如做出决断是艰难的，然而决断与担当是共同体最重要的德性，无此无以保护和延续共同体。他们也不愿意生育，原子式的丁克小家庭驱赶走数代同堂的大家族，人们出于理性计算，恐惧生育的代价，而当生育都成为需要严肃考虑的问题时，这说明该文化实体已到病态地步，直待边疆热衷生育，尚未遗失血气与本能的蛮族席卷而来，吞没原子小家庭，鸠占鹊巢，原本的共同体分崩离析。 　　 到这一地步时，凛冬结束，因为该文化实体已然死亡，他的某些碎片或许会被朴实尚武的蛮族继承，以其尸体，成为新文化实体出生的养料。但大多数人，因为其过于发达的理性，不再信任神明与道德，失去了变成文化民族，组建新共同体的资格，并由于不愿生育，而日渐消亡于风尘之中，斯宾格勒称之为费拉民族，也就是尼采笔下的末人，卑贱如同虫豸，让人再难想起昔日高尚荣光。 　　 在经历第一次世界鲁登道夫式总体战摧残以后，欧罗巴十九世纪短暂的辉煌被不幸终结，斯宾格勒悲观地认为西方迟早要步其他已然僵死或者灭亡的文明的后尘，荣光不再，整个世界在福利国家与平民社会造就费拉化的陷阱之中逐渐沉沦。此时所有人共同享受一种奴役下的平等，仰食国家福利，以劳作为耻，以滥交、吸毒、信仰禅宗、败坏道德风气为荣，因为除此外他们再也找不到其他乐趣调剂现实生活的单调与无聊，他们凝视着虚无主义的深渊，直到虚无主义将这群过于理性的末人吞噬殆尽。 　　 我们或许永远不会迎接末人社会的来临，或许正在迎接普世性的末人风潮，这取决于你的情景模拟能力对命运节点与趋势的判断。我们每个人都有此类情境模拟能力，只是多与少的问题，我们以此来剔除、分析命运的分岔口，至于何者为佳则见仁见智，但每一个人都会得到他的德性所应有的下场。 　　 也许早做决断更能躲避洪水滔天，毕竟决断与担当是共同体中最稀缺的资源，在我辈非以尚武为美德的柔顺文人当中更是稀缺，就仿佛在撒哈拉沙漠中寻觅一滴冰水，往往是白费气力。如果有人对未来感到无限悲观，迷茫不知所措，我倒是想以我最喜爱的现代诗人，汪海鸣阿姨的诗歌为他劝解：“年轻人别哭啊，你可知希望不会来。”",
                questionInSeconds: 0,
                answerInSeconds: 0,
                audioThanksFileUrl: staticFile("thanks.mp3"),
                onlyDisplayCurrentSentence: false,
                thanksInSeconds: 0,
            }}
            // Determine the length of the video based on the duration of the audio file
            // 下面这个函数主要用于渲染前计算内容的参数
            calculateMetadata={calculateMetadata}
        />
    );
};
